app/controllers/conversions_controller.rb

  def create
    @conversion = Conversion.new(params[:conversion])
    @conversion.ip_address = request.remote_ip
    if @conversion.save
---
INSERT INTO `conversions` (`content_type`, `updated_at`, `from`, `to`, `filename`, `created_at`) VALUES(NULL, '2009-02-07 23:27:16', NULL, NULL, 'Docx2Rtf_Example.docx', '2009-02-07 23:27:16')